CFD_OF2/Section3_MeshRefine/MeshA_Refine/MeshA_Ref2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          108;
        startFace       20151;
    }
    outlet
    {
        type            patch;
        nFaces          108;
        startFace       20259;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          176;
        startFace       20367;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          93;
        startFace       20543;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          93;
        startFace       20636;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20440;
        startFace       20729;
    }
)

// ************************************************************************* //
