CFD_OF2/Section3_MeshRefine/MeshA_Refine/MeshA_Ref2/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    pi_4 
    {
        type    lineCell;
        axis    xyz;
        start   (0.354 0.354 0.005);
        end     (4 4 0.005);
    }

    pi_2
    {
        type    lineCell;
        axis    xyz;
        start   (0 0.5 0.005);
        end     (0 4 0.005);
    }

    threepi_4
    {
        type    lineCell;
        axis    xyz;
        start   (-0.354 0.354 0.005);
        end     (-4 4 0.005);
    }
);

fields          ( p U );


// ************************************************************************* //
